app/Http/Controllers/DashboardController.php

    public function index(Request $request)
    {

        $zones = Zone::get();
        $user = auth()->user();

        $time = Carbon::now()->toTimeString();
        $date = Carbon::now()->toDateString();





        $pastReservation = Reservation::where('date_when', '<=', $date)->where('end_time', '<=', $time)->get();


        foreach ($pastReservation as $past) {
            DB::table('reservations')->where('id', $past->id)->update(['old_reservation' => 1]);
        }

        $reservations = Reservation::orderBy('updated_at', 'desc')->where('old_reservation', 0)->get();

        $pastReservation = Reservation::where('date_when', '<', $date)->get();
        foreach ($pastReservation as $past) {
            DB::table('reservations')->where('id', $past->id)->update(['old_reservation' => 1]);
        }
        if($user){



            $reservations = Reservation::orderBy('updated_at','desc')->where('user_id',$user->id)->where('old_reservation', 0)->paginate(3);
            $notes = Note::orderBy('updated_at','desc')->where('user_id',$user->id)->paginate(3);
---
select * from `zones`
select * from `reservations` where `date_when` <= '2022-05-24' and `end_time` <= '00:52:22'
update `reservations` set `old_reservation` = 1 where `id` = 8
select * from `reservations` where `old_reservation` = 0 order by `updated_at` desc
select * from `reservations` where `date_when` < '2022-05-24'
update `reservations` set `old_reservation` = 1 where `id` = 5
select * from `reservations` where `user_id` = 1 and `old_reservation` = 0 order by `updated_at` desc limit 3 offset 0
select count(*) as aggregate from `reservations` where `user_id` = 1 and `old_reservation` = 0
select * from `notes` where `user_id` = 1 order by `updated_at` desc limit 3 offset 0
select count(*) as aggregate from `notes` where `user_id` = 1

            ]);
        } else {

            $reservation = Reservation::orderBy('updated_at','desc')->where('old_reservation', 0)->first();
---
select * from `reservations` where `old_reservation` = 0 order by `updated_at` desc limit 1