app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `notes` where `user_id` = 1
---
    public function index(Request $request)
    {
        $user = auth()->user();
        if($user){
            $reservations = Reservation::orderBy('created_at','desc')->where('user_id',$user->id)->paginate(3, ['*'], 'rezervacijos');
            $notes = Note::orderBy('created_at','desc')->where('user_id',$user->id)->paginate(3, ['*'], 'uzrasai');