app/Http/Controllers/NoteFilterController.php

select * from `notes` where `user_id` = 1 and `updated_at` = '2022-05-24 00:59:11' order by `created_at` desc
---
    public function index(Request $request)
    {
        $user = $request->user()->id;
        $notes = Note::orderBy('created_at', 'desc')->where('user_id', $user);






        switch ($request->input() != null) {
            case ($request->input('createdWhen')):

                $notes = $notes->where('updated_at', $request->input('createdWhen'))->get();