app/Http/Controllers/NoteController.php

select * from `notes` where `user_id` = 2 order by `created_at` desc
---
    public function index(Request $request){
        $user = $request->user()->id;
        $notes = Note::orderBy('created_at', 'desc')->where('user_id', $user)->get();