app/Http/Controllers/NoteFormController.php

    public function createNote(Request $request)
    {
        $this->validate($request, [
            'title' => 'required',
            'body' => 'required'
        ]);

        $request->user()->notes()->create([
            'title' => $request->title,
            'body' => $request->body
        ]);
---
insert into `notes` (`title`, `body`, `user_id`, `updated_at`, `created_at`) values ('aasdadasd', 'asdasd', 1, '2022-05-24 00:41:15', '2022-05-24 00:41:15')

    public function editNote(Request $request, Note $note)
    {

        $this->validate($request, [
            'titleMod' => 'required',
            'bodyMod' => 'required'
        ]);
        if(($request->titleMod != $note->title) || ($request->bodyMod != $note->body)){
            $request->user()->notes()->where('id', $note->id)->update([
                'title' => $request->titleMod,
                'body' => $request->bodyMod,
            ]);
---
update `notes` set `title` = 'asdasd', `body` = 'čėą', `notes`.`updated_at` = '2022-05-24 01:04:09' where `notes`.`user_id` = 1 and `notes`.`user_id` is not null and `id` = 4

    public function deleteNote(Request $request, Note $note)
    {

        $request->user()->notes()->where('id', $note->id)->delete();
---
delete from `notes` where `notes`.`user_id` = 2 and `notes`.`user_id` is not null and `id` = 5

    public function editNoteFromDashboard(Request $request, Note $note)
    {
        $this->validate($request, [
            'title' => 'required',
            'body' => 'required'
        ]);
        if(($request->title != $note->title) || ($request->body != $note->body)){
            $request->user()->notes()->where('id', $note->id)->update([
                'title' => $request->title,
                'body' => $request->body,
            ]);
---
update `notes` set `title` = 'asdasd', `body` = '123123asd', `notes`.`updated_at` = '2022-05-24 01:08:17' where `notes`.`user_id` = 1 and `notes`.`user_id` is not null and `id` = 4