app/Http/Controllers/RegisterController.php

    public function addUser(Request $request)
    {
            $this->validate($request,[
                'name' => 'required|string|max:255',
                'surname' => 'required|string|max:255',
                'role' => 'required|string|max:255',
                'email' => ['required','email','unique:users,email'],
                'password' => [ Password::min(8)
                ->mixedCase()
                ->numbers()
                ->symbols(),
                'required',
                'confirmed'],
                'level' => 'required'
            ]);
                User::create([
                'name' => $request->name,
                'surname' => $request->surname,
                'role' => $request->role,
                'email' => $request->email,
                'password' => Hash::make($request->password),
                'user_level_id' => $request->level
            ]);
---
insert into `users` (`name`, `surname`, `role`, `email`, `password`, `user_level_id`, `updated_at`, `created_at`) values ('Marius', 'Garbenis', 'Admin', 'mariusgarbenis2@gmail.com', '$2y$10$gvPI0MjwNbXYF2Abe.KEA.QTC/5v.Rcu68l25hJgBRGxtgcxwYPeS', '1', '2022-05-24 01:16:15', '2022-05-24 01:16:15')