app/Http/Controllers/ReservationFilterController.php

    public function index(Request $request)
    {
        $date = date('Y-m-d');
        $zones = Zone::get();
        $users = User::get();

        $pastReservation = Reservation::where('date_when', '<', $date)->get();



        foreach ($pastReservation as $past) {
            DB::table('reservations')->where('id', $past->id)->update(['old_reservation' => 1]);
        }


        $reservations = Reservation::orderBy('updated_at', 'desc')->where('old_reservation', 0);
        switch ($request->input() != null) {
            case ($request->input('userId')):
                $reservations = $reservations->where('user_id', $request->input('userId'))->get();
                break;
            case ($request->input('zoneId')):
                $reservations = $reservations->where('zone_id', $request->input('zoneId'))->get();
                break;
            case ($request->input('resWhen')):
                $reservations = $reservations->where('updated_at', $request->input('resWhen'))->get();
---
select * from `zones`
select * from `users`
select * from `reservations` where `date_when` < '2022-05-24'
update `reservations` set `old_reservation` = 1 where `id` = 5
select * from `reservations` where `old_reservation` = 0 and `zone_id` = '1' order by `updated_at` desc
select * from `reservations` where `old_reservation` = 0 and `user_id` = '4' order by `updated_at` desc