app/Http/Controllers/ReservationFormController.php

    public function createReservation(Request $request)
    {

        $this->validate($request, [
            'zone' => 'required',
            'people_count' => 'required',
            'date_when' => 'required',
            'start_time' => 'required',
            'end_time'  => 'required'
        ]);

        if ($request->input('start_time') >= $request->input('end_time')) {
            return back()->with('status', 'Pradžios laikas negali būti vėlesnis arba toks pat kaip pabaigos laiką');
        }
        if ($request->input()) {

            $reservation = Reservation::where('zone_id', $request->input('zone'))
                ->where('date_when', $request->input('date_when'))->first();
            $zone = Zone::where('id', $request->input('zone'))->first();
---
select * from `reservations` where `zone_id` = '3' and `date_when` = '2022-05-25'
select * from `zones` where `id` = '3' limit 1




        $request->user()->reservations()->create([
            'zone_id' => $request->zone,
            'people_count' => $request->people_count,
            'date_when' => $request->date_when,
            'start_time' => $request->start_time,
            'end_time' => $request->end_time
        ]);
---
insert into `reservations` (`zone_id`, `people_count`, `date_when`, `start_time`, `end_time`, `user_id`, `updated_at`, `created_at`) values ('3', '4', '2022-05-25', '08:15:00', '09:00:00', 3, '2022-05-24 02:15:20', '2022-05-24 02:15:20')

    public function editReservation(Request $request, Reservation $reservation)
    {
        $otherReservation = Reservation::where('zone_id', $request->input('zone'))
            ->where('date_when', $request->input('date_when'))->get();

        $reservationFirst = Reservation::where('zone_id', $request->input('zone'))
            ->where('date_when', $request->input('date_when'))->first();

        $zone = Zone::where('id', $request->input('zone'))->first();
---
select * from `reservations` where `zone_id` = '1' and `date_when` = '2022-05-26'
select * from `zones` where `id` = '1' limit 1

    public function editReservationFromDashboard(Request $request, Reservation $reservation)
    {
        $request->user()->reservations()->where('id', $reservation->id)->update([
            'zone_id' => $request->zone,
            'people_count' => $request->people_count,
            'date_when' => $request->date_when,
            'start_time' => $request->start_time,
            'end_time' => $request->end_time
        ]);
---
select * from `reservations` where `zone_id` = '1' and `date_when` = '2022-05-26'
select * from `zones` where `id` = '1' limit 1