app/Http/Controllers/ReservationController.php

    public function index()
    {
        $time = Carbon::now()->toTimeString();
        $date = Carbon::now()->toDateString();

        $zones = Zone::get();
        $users = User::get();



        $pastReservation = Reservation::where('date_when', '<=', $date)->where('end_time', '<=', $time)->get();


        foreach ($pastReservation as $past) {
            DB::table('reservations')->where('id', $past->id)->update(['old_reservation' => 1]);
        }

        $reservations = Reservation::orderBy('updated_at', 'desc')->where('old_reservation', 0)->get();
---
select * from `zones`
select * from `users`
select * from `reservations` where `date_when` <= '2022-05-24' and `end_time` <= '02:19:04'
update `reservations` set `old_reservation` = 1 where `id` = 8
select * from `reservations` where `old_reservation` = 0 order by `updated_at` desc