app/Http/Controllers/UsersController.php

    public function index(Request $request) {
        $users = User::orderBy('name', 'asc')->get();
        $userLevels = UserLevel::get();
---
select * from `users` order by `name` asc
select * from `user_levels`