app/Http/Controllers/UserFilterController.php

    public function index(Request $request){
        $users = User::orderBy('name', 'asc');
        $userLevels = UserLevel::get();
        $uri = $request->path();

        switch ($request->input() != null) {
            case ($request->input('userNames')):
                $fullName = explode(';',$request->input('userNames'));
                $users = $users->where('name', $fullName[0])->where('surname', $fullName[1])->get();
---
select * from `user_levels`
select * from `users` where `name` = 'Tomas' and `surname` = 'Tomauskas' order by `name` asc